<?php

return [
    'DELETE_FLG_OFF' => 0,
    'DELETE_FLG_ON' => 1,
    'DELTA' => 7,
    'SORT_TYPE' => [
        'u' => 'ASC',  //昇順
        'd' => 'DESC',  //降順
    ],
    'STATUS' => [
        'UNVERIFIED' => 0,  //メール未認証
        'VERIFIED' => 1,  //メール認証済み
    ],
    'LOGIN_PAGE_KIND' => [
        'MEMBER' => 'member',  //利用者ページ
        'ADMIN' => 'admin',  //管理ページ
    ],
    'MEMBER' => [
        'PC' => [
            'LIST_PER_PAGE' => 20,
        ],
        'SP' => [
            'LIST_PER_PAGE' => 20,
        ],
    ],
    'ADMIN' => [
        'LIST_PER_PAGE' => 20,
        'LOGIN_STATUS' => [
            'REMEMBER' => 'keep_login',
            'FORGET' => 'forget',
            'CHECK_VALUE' => 1,
        ],
    ],
    'ARTICLE' => [
        'STATUS' => [
            'PREPARATION' => [
                'NAME' => '準備中',
                'NUMBER' => 1,
                'SEARCH_NUMBER' => 1,
            ],
            'WAITING' => [
                'NAME' => '公開待ち',
                'NUMBER' => 0,
                'SEARCH_NUMBER' => 2,
            ],
            'RELEASED' => [
                'NAME' => '公開',
                'NUMBER' => 0,
                'SEARCH_NUMBER' => 0,
            ],
        ],
        'TYPE' => [
            'UNREGISTERED' => [
                'NUMBER' => 0,
                'NAME' => '全公開'
            ],
            'MEMBER' => [
                'NUMBER' => 1,
                'NAME' => '会員のみ公開'
            ],
        ],
        'KIND' => [
            'RECIPE' => [
                'NUMBER' => 0,
                'NAME' => 'レシピ'
            ],
            'LUNCH_ALLDAY' => [
                'NUMBER' => 1,
                'NAME' => '部活弁'
            ],
            'LUNCH_WEEKDAY' => [
                'NUMBER' => 2,
                'NAME' => '平日弁'
            ],
            'DINNER' => [
                'NUMBER' => 3,
                'NAME' => '夕飯'
            ],
            'BASIC' => [
                'NUMBER' => 4,
                'NAME' => '基本'
            ],
            'USEFUL' => [
                'NUMBER' => 5,
                'NAME' => 'お役立ち'
            ],
        ],
        'FEATURE' => [
            'CALORIE' => [
                'NUMBER' => 0,
                'NAME' => '低カロリー'
            ],
            'SALT' => [
                'NUMBER' => 1,
                'NAME' => '塩分控えめ'
            ],
            'AGING' => [
                'NUMBER' => 2,
                'NAME' => 'アンチエイジング'
            ],
            'PROTEIN' => [
                'NUMBER' => 3,
                'NAME' => '高タンパク質'
            ],
            'IRON' => [
                'NUMBER' => 4,
                'NAME' => '高鉄分'
            ],
        ],
    ],
    'DATE' => [
        "YEAR" => [
            2023 => 2023,
            2024 => 2024,
            2025 => 2025,
            2026 => 2026,
            2027 => 2027,
            2028 => 2028,
            2029 => 2029,
            2030 => 2030,
            2031 => 2031,
            2032 => 2032,
        ],
        "MONTH" => [
            1  => 1,
            2  => 2,
            3  => 3,
            4  => 4,
            5  => 5,
            6  => 6,
            7  => 7,
            8  => 8,
            9  => 9,
            10 => 10 ,
            11 => 11 ,
            12 => 12 ,
        ],
        "HOUR" => [
            0  => 0,
            1  => 1,
            2  => 2,
            3  => 3,
            4  => 4,
            5  => 5,
            6  => 6,
            7  => 7,
            8  => 8,
            9  => 9,
            10 => 10,
            11 => 11,
            12 => 12,
            13 => 13,
            14 => 14,
            15 => 15,
            16 => 16,
            17 => 17,
            18 => 18,
            19 => 19,
            20 => 20,
            21 => 21,
            22 => 22,
            23 => 23,
        ],
        "MINUTE" => [
            0  => 0,
            1  => 1,
            2  => 2,
            3  => 3,
            4  => 4,
            5  => 5,
            6  => 6,
            7  => 7,
            8  => 8,
            9  => 9,
            10 => 10,
            11 => 11,
            12 => 12,
            13 => 13,
            14 => 14,
            15 => 15,
            16 => 16,
            17 => 17,
            18 => 18,
            19 => 19,
            20 => 20,
            21 => 21,
            22 => 22,
            23 => 23,
            24 => 24,
            25 => 25,
            26 => 26,
            27 => 27,
            28 => 28,
            29 => 29,
            30 => 30,
            31 => 31,
            32 => 32,
            33 => 33,
            34 => 34,
            35 => 35,
            36 => 36,
            37 => 37,
            38 => 38,
            39 => 39,
            40 => 40,
            41 => 41,
            42 => 42,
            43 => 43,
            44 => 44,
            45 => 45,
            46 => 46,
            47 => 47,
            48 => 48,
            49 => 49,
            50 => 50,
            51 => 51,
            52 => 52,
            53 => 53,
            54 => 54,
            55 => 55,
            56 => 56,
            57 => 57,
            58 => 58,
            59 => 59,
        ],
    ],
    'ACTRESS' => [
        'SIZE' => [
            'A' => 'A',
            'B' => 'B',
            'C' => 'C',
            'D' => 'D',
            'E' => 'E',
            'F' => 'F',
            'G' => 'G',
            'H' => 'H',
            'I' => 'I',
            'J' => 'J',
            'K' => 'K',
            'L' => 'L',
            'M' => 'M',
            'N' => 'N',
            'O' => 'O',
            'P' => 'P',
            'Q' => 'Q',
            'R' => 'R',
            'S' => 'S',
            'T' => 'T',
            'U' => 'U',
            'V' => 'V',
            'W' => 'W',
            'X' => 'X',
            'Y' => 'Y',
            'Z' => 'Z',
        ],
    ],
    'PLATFORM' => [
        'FC2' => 1,
    ],
    'SITE' => [
        'FC2' => 1,
    ],
    'AFFILIATE_ID' => [
        'FC2' => env('FC2_USER_PARAM', 'TXprMU1UZ3lOamc9'),
    ],
];